[
  { "id": 1, "excuse": "My Wi-Fi was down because my neighbor’s cat unplugged it." },
  { "id": 2, "excuse": "I couldn’t come to the meeting, I was busy fighting a goose." },
  { "id": 3, "excuse": "My alarm clock joined a protest and refused to go off." },
  { "id": 4, "excuse": "Traffic was bad because a llama parade blocked the road." },
  { "id": 5, "excuse": "I accidentally glued myself to my desk chair." },
  { "id": 6, "excuse": "My dog ate my homework, and then blamed the neighbor." },
  { "id": 7, "excuse": "I got stuck in an elevator with a mariachi band." },
  { "id": 8, "excuse": "Aliens abducted me, but they brought me back before I missed anything important." },
  { "id": 9, "excuse": "I was testing my invisibility cloak, and it didn’t work." },
  { "id": 10, "excuse": "My cat walked over the keyboard and sent an email by accident." },
  { "id": 11, "excuse": "I tried to join a Zoom call but got trapped in a Minecraft server." },
  { "id": 12, "excuse": "My coffee machine broke down and I couldn’t function without caffeine." },
  { "id": 13, "excuse": "I got locked out of my own house by my smart lock system." },
  { "id": 14, "excuse": "I mistook the deadline for a suggestion." },
  { "id": 15, "excuse": "My phone fell in the toilet and I had to rescue it." },
  { "id": 16, "excuse": "My GPS took me to Narnia instead of the office." },
  { "id": 17, "excuse": "I was abducted by my responsibilities and they didn’t let me go." },
  { "id": 18, "excuse": "My computer had a meltdown because I spilled soda on it." },
  { "id": 19, "excuse": "I was stuck in traffic caused by a herd of sheep on the highway." },
  { "id": 20, "excuse": "I accidentally joined a cult but escaped just in time." },
  { "id": 21, "excuse": "My toaster caught fire and I had to call the fire department." },
  { "id": 22, "excuse": "I was busy writing a novel, but then got distracted by my cat." },
  { "id": 23, "excuse": "I went to the grocery store and ended up adopting a parrot." },
  { "id": 24, "excuse": "My internet provider went on strike." },
  { "id": 25, "excuse": "I was stuck in an endless loop of YouTube tutorials." },
  { "id": 26, "excuse": "I lost track of time chasing a squirrel in the park." },
  { "id": 27, "excuse": "My smartwatch started a countdown I couldn’t stop." },
  { "id": 28, "excuse": "I accidentally deleted my whole project and had to start over." },
  { "id": 29, "excuse": "My neighbor’s drone crashed into my window." },
  { "id": 30, "excuse": "I was abducted by pirates, but they returned me after dinner." },
  { "id": 31, "excuse": "My fridge was empty so I had to hunt for snacks." },
  { "id": 32, "excuse": "I got caught in a flash mob while walking to work." },
  { "id": 33, "excuse": "I was busy decoding an ancient map I found." },
  { "id": 34, "excuse": "My calendar app crashed and deleted all my reminders." },
  { "id": 35, "excuse": "I fell into a rabbit hole while browsing the internet." },
  { "id": 36, "excuse": "My cat decided today was the perfect day to learn how to type." },
  { "id": 37, "excuse": "I was stuck behind a herd of turtles crossing the road." },
  { "id": 38, "excuse": "My bike got stolen by a mysterious figure in a trench coat." },
  { "id": 39, "excuse": "I was busy building a fort to hide from responsibilities." },
  { "id": 40, "excuse": "My headphones stopped working mid-conference call." },
  { "id": 41, "excuse": "I was abducted by garden gnomes for questioning." },
  { "id": 42, "excuse": "My internet router decided to take a nap." },
  { "id": 43, "excuse": "I was busy trying to teach my dog how to use the remote." },
  { "id": 44, "excuse": "My toaster launched my bread into orbit." },
  { "id": 45, "excuse": "I was trapped in a maze of my own making." },
  { "id": 46, "excuse": "My keyboard caught fire from all the typing I was doing." },
  { "id": 47, "excuse": "I was kidnapped by squirrels but escaped with nuts." },
  { "id": 48, "excuse": "My car ran out of gas in the middle of nowhere." },
  { "id": 49, "excuse": "I was busy chasing a butterfly that looked like my boss." },
  { "id": 50, "excuse": "My phone's battery was stuck at 1% for hours." },
  { "id": 51, "excuse": "I got lost in IKEA and couldn’t find my way out." },
  { "id": 52, "excuse": "My alarm clock was set to PM instead of AM." },
  { "id": 53, "excuse": "I had to rescue a kitten stuck in a tree." },
  { "id": 54, "excuse": "My smartwatch got stuck updating all night." },
  { "id": 55, "excuse": "I was trapped in a virtual reality game." },
  { "id": 56, "excuse": "My coffee machine decided to protest against mornings." },
  { "id": 57, "excuse": "I accidentally locked myself in the bathroom." },
  { "id": 58, "excuse": "My GPS sent me to the wrong country." },
  { "id": 59, "excuse": "I was hypnotized by a magic show and forgot the time." },
  { "id": 60, "excuse": "My cat hid my car keys in a secret spot." },
  { "id": 61, "excuse": "I was abducted by time travelers." },
  { "id": 62, "excuse": "My houseplants staged a rebellion and refused to be watered." },
  { "id": 63, "excuse": "I got caught in a rainstorm without an umbrella." },
  { "id": 64, "excuse": "My computer was hacked by a group of friendly hackers." },
  { "id": 65, "excuse": "I was trapped under a pile of laundry." },
  { "id": 66, "excuse": "My headphones turned into a tangled mess." },
  { "id": 67, "excuse": "I lost my voice after screaming at a video game." },
  { "id": 68, "excuse": "I was abducted by a band of circus performers." },
  { "id": 69, "excuse": "My phone screen cracked and I couldn’t see anything." },
  { "id": 70, "excuse": "I was busy teaching my parrot to swear." },
  { "id": 71, "excuse": "My internet service was interrupted by a meteor shower." },
  { "id": 72, "excuse": "I accidentally adopted a pet rock." },
  { "id": 73, "excuse": "I got stuck in a revolving door." },
  { "id": 74, "excuse": "My laptop battery exploded (just kidding, but it felt like it)."},
  { "id": 75, "excuse": "I was busy making a cake that looked like a unicorn." },
  { "id": 76, "excuse": "My dog ran away with my homework." },
  { "id": 77, "excuse": "I was stuck in a conversation about the meaning of life." },
  { "id": 78, "excuse": "My printer jammed and printed a novel instead." },
  { "id": 79, "excuse": "I got stuck in a never-ending elevator ride." },
  { "id": 80, "excuse": "My fridge broke and all my food escaped." },
  { "id": 81, "excuse": "I was trapped in a time loop and kept reliving Monday." },
  { "id": 82, "excuse": "My cat walked on my keyboard and sent a cryptic message." },
  { "id": 83, "excuse": "I was abducted by garden gnomes on a secret mission." },
  { "id": 84, "excuse": "My internet cable was chewed by a mysterious animal." },
  { "id": 85, "excuse": "I got caught in a flash mob and couldn’t escape." },
  { "id": 86, "excuse": "My phone died right before an important call." },
  { "id": 87, "excuse": "I was trapped in my own thoughts for too long." },
  { "id": 88, "excuse": "My coffee tasted like sadness and I couldn’t function." },
  { "id": 89, "excuse": "I was stuck behind a parade of ducks." },
  { "id": 90, "excuse": "My laptop decided to update at the worst possible moment." },
  { "id": 91, "excuse": "I was abducted by friendly robots for a tea party." },
  { "id": 92, "excuse": "My headphones tangled themselves into a knot of despair." },
  { "id": 93, "excuse": "I got stuck in a library maze." },
  { "id": 94, "excuse": "My calendar app deleted all my appointments by accident." },
  { "id": 95, "excuse": "I was busy writing a song for my pet goldfish." },
  { "id": 96, "excuse": "My car was taken hostage by a gang of raccoons." },
  { "id": 97, "excuse": "I got lost in a corn maze for hours." },
  { "id": 98, "excuse": "My phone auto-corrected my message into gibberish." },
  { "id": 99, "excuse": "I was trapped in an online shopping spree I couldn’t escape." },
  { "id": 100, "excuse": "My dog hid my wallet in the backyard." },
  { "id": 101, "excuse": "I was abducted by a group of friendly vampires." },
  { "id": 102, "excuse": "My fridge froze all my snacks into an ice sculpture." },
  { "id": 103, "excuse": "I was caught in a sudden snowstorm without a jacket." },
  { "id": 104, "excuse": "My computer decided to take a vacation." },
  { "id": 105, "excuse": "I got stuck in traffic caused by a rollercoaster malfunction." },
  { "id": 106, "excuse": "My cat was using the keyboard to write a novel." },
  { "id": 107, "excuse": "I was busy assembling IKEA furniture with no instructions." },
  { "id": 108, "excuse": "My phone ran out of storage right before saving my work." },
  { "id": 109, "excuse": "I was hypnotized by a street magician and lost track of time." },
  { "id": 110, "excuse": "My internet went out because a squirrel chewed the cables." },
  { "id": 111, "excuse": "I was caught in a debate about whether pineapple belongs on pizza." },
  { "id": 112, "excuse": "My smartwatch kept buzzing with fake notifications." },
  { "id": 113, "excuse": "I was stuck in a never-ending video buffering loop." },
  { "id": 114, "excuse": "My dog hid my keys in a secret spot." },
  { "id": 115, "excuse": "I was trapped in an elevator with a mime." },
  { "id": 116, "excuse": "My keyboard stopped working during a crucial moment." },
  { "id": 117, "excuse": "I was busy teaching my parrot to talk." },
  { "id": 118, "excuse": "My laptop battery died mid-presentation." },
  { "id": 119, "excuse": "I got stuck in a revolving door and couldn't get out." },
  { "id": 120, "excuse": "My internet provider had a nationwide outage." },
  { "id": 121, "excuse": "I accidentally spilled coffee on my keyboard." },
  { "id": 122, "excuse": "I was busy rescuing a lost puppy." },
  { "id": 123, "excuse": "My phone fell into a cup of water." },
  { "id": 124, "excuse": "I was abducted by time travelers." },
  { "id": 125, "excuse": "My car wouldn't start because of a dead battery." },
  { "id": 126, "excuse": "I was caught in a sudden thunderstorm." },
  { "id": 127, "excuse": "My GPS took me to the wrong destination." },
  { "id": 128, "excuse": "I was busy baking cookies for my neighbors." },
  { "id": 129, "excuse": "My cat hid my laptop charger." },
  { "id": 130, "excuse": "I lost my voice after cheering too loudly." },
  { "id": 131, "excuse": "My smartwatch was stuck on update mode." },
  { "id": 132, "excuse": "I was trapped in a traffic jam caused by a parade." },
  { "id": 133, "excuse": "My computer crashed and I lost my work." },
  { "id": 134, "excuse": "I got stuck in a bookstore browsing too many books." },
  { "id": 135, "excuse": "My phone screen cracked and became unusable." },
  { "id": 136, "excuse": "I was abducted by friendly aliens." },
  { "id": 137, "excuse": "My fridge stopped working and spoiled all my food." },
  { "id": 138, "excuse": "I was stuck behind a slow-moving cyclist." },
  { "id": 139, "excuse": "My headphones stopped working during a call." },
  { "id": 140, "excuse": "I accidentally sent a message to the wrong person." },
  { "id": 141, "excuse": "My bike chain broke on the way to work." },
  { "id": 142, "excuse": "I was busy fixing a leaky faucet." },
  { "id": 143, "excuse": "My dog ran away and I had to find him." },
  { "id": 144, "excuse": "I was caught in a power outage." },
  { "id": 145, "excuse": "My computer needed an unexpected update." },
  { "id": 146, "excuse": "I was stuck in an elevator for 10 minutes." },
  { "id": 147, "excuse": "My phone battery died and I couldn’t call anyone." },
  { "id": 148, "excuse": "I was stuck in traffic caused by a car accident." },
  { "id": 149, "excuse": "My coffee machine broke and I couldn’t get my caffeine fix." },
  { "id": 150, "excuse": "I accidentally deleted important files." },
  { "id": 151, "excuse": "I was busy organizing my messy desk." },
  { "id": 152, "excuse": "My internet went out during an important meeting." },
  { "id": 153, "excuse": "I was abducted by circus clowns." },
  { "id": 154, "excuse": "My cat walked across my keyboard and submitted a blank email." },
  { "id": 155, "excuse": "I got stuck in a revolving door." },
  { "id": 156, "excuse": "My laptop overheated and shut down." },
  { "id": 157, "excuse": "I was stuck in a line that moved slower than a snail." },
  { "id": 158, "excuse": "My car tire went flat on the way here." },
  { "id": 159, "excuse": "I was busy feeding a stray cat." },
  { "id": 160, "excuse": "My phone was stolen, and I had to report it." },
  { "id": 161, "excuse": "I was stuck behind a herd of cows on the road." },
  { "id": 162, "excuse": "My smartwatch glitched and gave me wrong notifications." },
  { "id": 163, "excuse": "I was trapped in a sudden hailstorm." },
  { "id": 164, "excuse": "My computer froze during a critical task." },
  { "id": 165, "excuse": "I got locked out of my house." },
  { "id": 166, "excuse": "My internet was down because of construction work nearby." },
  { "id": 167, "excuse": "I was stuck in traffic due to a parade of ducks." },
  { "id": 168, "excuse": "My dog needed an emergency vet visit." },
  { "id": 169, "excuse": "I accidentally overslept because my alarm didn’t go off." },
  { "id": 170, "excuse": "My car was blocked by a delivery truck." },
  { "id": 171, "excuse": "I was abducted by pirates on the way to work." },
  { "id": 172, "excuse": "My laptop battery stopped charging." },
  { "id": 173, "excuse": "I got caught in a flash mob and couldn’t leave." },
  { "id": 174, "excuse": "My headphones stopped working mid-conference call." },
  { "id": 175, "excuse": "I was stuck behind a slow-moving tractor." },
  { "id": 176, "excuse": "My phone screen froze and I couldn’t unlock it." },
  { "id": 177, "excuse": "I was busy chasing a squirrel in the park." },
  { "id": 178, "excuse": "My keyboard stopped responding." },
  { "id": 179, "excuse": "I was trapped in an online game." },
  { "id": 180, "excuse": "My internet went out because of a power outage." },
  { "id": 181, "excuse": "I was busy fixing a broken fence." },
  { "id": 182, "excuse": "My phone’s battery got stuck at 0%." },
  { "id": 183, "excuse": "I accidentally deleted my calendar events." },
  { "id": 184, "excuse": "I got stuck in a conversation about conspiracy theories." },
  { "id": 185, "excuse": "My coffee machine exploded." },
  { "id": 186, "excuse": "I was caught in a sudden hailstorm." },
  { "id": 187, "excuse": "My car battery died on the way." },
  { "id": 188, "excuse": "I was abducted by a group of friendly robots." },
  { "id": 189, "excuse": "My internet router crashed." },
  { "id": 190, "excuse": "My dog hid my car keys." },
  { "id": 191, "excuse": "I got stuck in a revolving door." },
  { "id": 192, "excuse": "My phone fell into a cup of water." },
  { "id": 193, "excuse": "I was busy baking cookies." },
  { "id": 194, "excuse": "My cat walked across my keyboard." },
  { "id": 195, "excuse": "I was stuck in a never-ending Zoom meeting." },
  { "id": 196, "excuse": "My laptop overheated and shut down." },
  { "id": 197, "excuse": "I accidentally sent a message to the wrong person." },
  { "id": 198, "excuse": "I was stuck behind a parade of ducks." },
  { "id": 199, "excuse": "My fridge stopped working." },
  { "id": 200, "excuse": "I got lost in IKEA." }
  ]
